Repository: dtcs2017/RedKiteCmsBundle
Catalog: Resources/translations/AlphaLemonCmsBundle.*.xliff
Languages: it

# languages-controller-5
source: Is Main
it: Lingua principale

# languages-controller-6
source: Languages selector
it: Seleziona una lingua

# languages-controller-7
source: The language has been successfully deleted
it: La lingua è stata rimossa correttamente

# languages-controller-8
source: The language has not been deleted
it: La lingua non è stata rimossa

# languages-controller-9
source: Any language has been choosen for removing
it: Nessuna lingua è stata selezionata per l'eliminazione

# languages-controller-10
source: To manage languages you must enable the intl extension in your php.ini file. Operation aborted
it: Per gestire le lingue è necessario abilitare l'estensione intl nel file php.ini. Operazione annullata

# languages-controller-11
source: The language has been successfully saved
it: La lingua è stata salvata correttamente

# languages-controller-12
source: The language has not been saved because an error has been occoured
it: La lingua non è stata salvata a causa di un errore

# languages-controller-13
source: The language has not been saved because an unespected error has been occoured when saving
it: La lingua non è stata salvata perchè si è verificato un errore inaspettato

# languages-controller-14
source: Any language has been choosen for removing
it: Nessuna lingua è stata selezionata per la rimozione

# languages-controller-15
source: The language has not been deleted
it: La lingua non è stata eliminata

# pages-controller-1
source: Page
it: Pagina

# pages-controller-4
source: Page attributes
it: Attributi pagina

# pages-controller-5
source: Page name
it: Nome pagina

# pages-controller-6
source: Type here an unique name for the page
it: Inserisci un nome univoco per la pagina

# pages-controller-8
source: Choose one template from the current theme
it: Seleziona un template dal tema in uso

# pages-controller-9
source: Home page
it: Pagina principale

# pages-controller-10
source: Set the page as the home page of your website. This is the page displayed when any specific page has been requested
it: Seleziona questa opzione per promuovere la pagina selezionata a pagina principale del sito. La pagina principale e' quello mostrato di default quando non e' stata richiesta una pagina in particolare

# pages-controller-11
source: Published
it: Pubblicata

# pages-controller-12
source: Check this option to publish the page
it: Seleziona questa opzione per pubblicare la pagina

# pages-controller-13
source: SEO - Search Engines Optimization
it: SEO - Motori di ricerca

# pages-controller-15
source: This is a permanent link that identifies uniquely the page
it: Questo e' un link permanente che identifica univocamente la pagina

# pages-controller-17
source: The page title. It should be congruent with the page's text, it should always be compiled and is should be length 60 chars max
it: Il titolo della pagina. Dovrebbe essere congruente con in testo scritto nella pagina, dovrebbe essere sempre compilato e avere una lunghezza massima di 60 caratteri

# pages-controller-19
source: Provide here a brief description of the page. This attribute should always be compiled
it: Inserisci una breve descrizione della pagina. Questo attributo dovrebbe essere sempre compilato

# pages-controller-21
source: This attribute is no longer used by several Search Engines, so you could quite leave it blank
it: Questo attributo non è più usato da diversi motori di ricerca, quindi puoi tranquillamente lasciarlo vuoto.

# pages-controller-22
source: Change Frequency
it: Freq. aggiornamento

# pages-controller-23
source: Priority
it: Priorita'

# pages-controller-24
source: Pages selector
it: Seleziona una pagina

# pages-controller-25
source: Languages
it: Lingue

# pages-controller-26
source: Site pages
it: Pagine del sito

# pages-controller-27
source: And now select the language or remove the page
it: Ed ora seleziona la lingua oppure rimuovi la pagina

# pages-controller-28
source: The prefix [ al_ ] is not permitted to avoid conflicts with the application internal routes
it: Il prefisso [ al_ ] non è consentito per evitare conflitti con le rotte interne dell'applicazione

# pages-controller-29
source: The page has not been saved
it: La pagina non è stata salvata

# pages-controller-30
source: Any page has been choosen for removing
it: Nessuna pagina è stata scelta per essere rimossa

# pages-controller-31
source: Nothing to delete with the given parameters
it: Non c'è niente da rimuovere con i parametri forniti

# preview-controller-2
source: Back
it: Rit.

# security-controller-1
source: Users management
it: Gestione degli utenti

# security-controller-2
source: Username
it: Utente

# security-controller-4
source: Roles
it: Ruoli

# security-controller-5
source: Manage user
it: Gestione utente

# security-controller-7
source: Users
it: Utenti

# security-controller-8
source: Roles management
it: Gestione dei ruoli

# security-controller-9
source: Rolename
it: Nome ruolo

# security-controller-10
source: Manage role
it: Gestione ruolo

# security-controller-11
source: Role
it: Ruolo

# security-controller-12
source: User has not been saved
it: L'utente non è stato salvato

# security-controller-13
source: User has been saved
it: L'utente è stato salvato

# security-controller-14
source: Role has not been saved
it: Il ruolo non è stato salvato

# security-controller-15
source: Role has been saved
it: Il ruolo è stato salvato

# themes-controller-1
source: title
it: titolo

# themes-controller-2
source: description
it: descrizione

# themes-controller-3
source: author
it: autore

# themes-controller-4
source: website
it: sito web

# themes-controller-5
source: license
it: licenza

# themes-controller-6
source: Preview
it: Anteprima

# themes-controller-7
source: Activate
it: Attiva

# themes-controller-8
source: Start from this Theme
it: Inizia da questo tema

# themes-controller-9
source: Theme:
it: Tema:

# themes-controller-10
source: Previews the theme
it: Prova il tema in anteprima

# themes-controller-11
source: Activates the theme
it: Attiva il tema

# themes-controller-12
source: Resets and starts using this theme
it: Azzera ed inizia utilizzando questo tema

# themes-controller-13
source: Finalizes the change of theme
it: Finalizza il cambio di tema

# themes-controller-14
source: A Partial finalization removes only the blocks added by the new theme and replaced by blocks from previous theme.
it: Una finalizzazione parziare rimuove solamente i blocchi aggiunti dal nuovo tema e sostituiti con blocchi del tema precedente.

# themes-controller-15
source: A full finalization removes all the blocks saved from previous theme.
it: La finalizzazione completa rimuove tutti i blocchi del tema precedente.

# themes-controller-16
source: Partial
it: Parziale

# themes-controller-17
source: Full
it: Completa

# themes-controller-18
source: The theme has not been finalized due to an error occoured when saving to database
it: Il tema non è stato finalizzato a causa di un errore durante il salvataggio nel database

# themes-controller-19
source: The theme has been changed. Please wait while your site is reloading
it: Il tema è stato cambiato. Attendi un attimo mentre ricarico il sito

# themes-controller-20
source: The site has been bootstrapped with the new theme. This page is reloading
it: Il sito è stato inizializzato con il nuovo tema. Stò ricaricando la pagina

# themes-controller-21
source: It seems you have not mapped the "%template_name%" template. To change a theme each template must be mapped with a template from the new theme
it: Sembra che il template "%template_name%" non sia stato mappato. Per cambiare un tema ogni template deve essere mappato con un template del nuovo tema

# welcome-1
source: Welcome to AlphaLemon CMS
it: Benvenuto ad AlphaLemon CMS

# welcome-2
source: This is the AlphaLemon CMS background and usually it should be hide. There are many reasons you are seeing it, the most common are:
it: Questo è il background di AlphaLemon CMS e solitamente dovrebbe essere nascosto. Ci sono diverse ragioni per le quali lo stai vedendo:

# welcome-3
source: The page and/or the language you have requested does not exist
it: La pagina o il linguaggio richiesti non esistono

# welcome-4
source: The page has assigned a template not included in the theme you are using on your website
it: Hai assegnato alla pagina corrente un template che non è incluso nel tema in uso nel tuo sito web

# welcome-5
source: Your website has any page and/or language and/or theme
it: Il tuo sito web non ha nessuna lingua e/o pagina e/o tema

# welcome-6
source: Something has gone wrong during the install process
it: Qualcosa non ha funzionato durante l'installazione

# welcome-7
source: The action you made returns this response:
it: Il server riporta il seguente errore:
