Repository: dtcs2017/RedKiteCmsBundle
Catalog: Resources/translations/AlphaLemonCmsBundle.*.xliff
Languages: it

# exceptions-1
source: The configuration parameter %parameter% does not exist
it: Il parametro di configurazione %parameter% non esiste

# exceptions-2
source: AlBlockManager is only able to manage AlBlock objects
it: AlBlockManager puo' gestire solamente oggetti del tipo AlBlock

# exceptions-3
source: Any valid block has been setted. Nothing to delete
it: Non è stato impostato nessun Blocco valido. Non è stato rimosso nulla

# exceptions-4
source: The abstract method getDefaultValue() defined for the object %className% must return an array
it: Il metodo astratto getDefaultValue() definito per l'oggetto %className% deve restituire un array

# exceptions-5
source: The block deleting operation has been aborted
it: L'operazione di rimozione del contenuto è stata annullata

# exceptions-6
source: The operation to add a new block has been aborted
it: L'operazione di aggiunta di un nuovo Blocco è stata annullata

# exceptions-7
source: The block editing action has been aborted
it: L'operazione di modifica del contenuto è stata annullata

# exceptions-8
source: AlBlockManagerFactoryItem expects the following attributes: "%attributes%". Check the definition of the "%class%" object, into the bundle that implements it
it: AlBlockManagerFactoryItem si aspetta i seguenti attributi: "%attributes%". Verifica che la definizione della "%class%" dell'oggetto, nel bundle che la implementa

# exceptions-9
source: The image file has already been added
it: L'immagine e' gia' stata aggiunta

# exceptions-10
source: There is a configuration error in the form that manages this block: you must call that form "al_json_block". The best way to add a block which uses the json format to manage its data, is extending the form "AlphaLemon\AlphaLemonCmsBundle\Core\Form\JsonBlock\JsonBlockType" which already handles this configuration for you
it: Sembra esserci un errore di configurazione nel form che gestisce questo blocco: devi chiamare quel form "al_json_block". Il modo migliore per aggiungere un blocco che utilizza il formato json per la gestione del contenuto è di estendere la classe "AlphaLemon\AlphaLemonCmsBundle\Core\Form\JsonBlock\JsonBlockType" che implementa nativamente questa configurazione

# exceptions-12
source: It seems that the item requested does not exist anymore
it: Sembra che l'item richiesto non esista piu'

# exceptions-13
source: AlLanguageManager is able to manage only AlLanguage objects
it: AlLanguageManager puo' gestire solamente oggetti del tipo AlLanguage

# exceptions-14
source: Any language has been selected: delete operation aborted
it: Nessuna lingua è stata selezionata: l'operazione di cancellazione è stata annullata

# exceptions-15
source: The website main language cannot be deleted. To delete this language promote another one as main language, then delete it again
it: La lingua principale del sito non può essere rimossa. Per cancellare questa lingua promuovi un'altra lingua come linguaggio principale, poi procedi con la cancellazione

# exceptions-17
source: The language adding action has been aborted
it: L'operazione per la rimozione della lingua è stata annullata

# exceptions-18
source: The language you are trying to add, already exists in the website
it: La lingua che stai tentando di aggiungere è già presente nel tuo sito web

# exceptions-19
source: A language cannot be null. Please provide a valid language name to add the language
it: Fornisci un valido nome per la lingua che stai tentando di aggiungere

# exceptions-20
source: The language editing action has been aborted
it: L'operazione di modifica della lingua è stata annullata

# exceptions-21
source: AlPageManager is able to manage only AlPage objects
it: AlPageManager puo' gestire solamente oggetti del tipo AlPage

# exceptions-22
source: Any page has been selected: delete operation aborted
it: Nessuna pagina è stata selezionata: l'operazione di cancellazione è stata annullata

# exceptions-23
source: The name to assign to the page cannot be null. Please provide a valid page name to add your page
it: Il nome da assegnare alla pagina non può essere vuoto. Fornisci un nome valido per poter aggiungere la pagina

# exceptions-24
source: The page deleting action has been aborted
it: L'operazione di cancellazione della pagina è stata annullata

# exceptions-25
source: The page adding action has been aborted
it: L'operazione di aggiunta della nuova pagina è stata annullata

# exceptions-26
source: It is not allowed to remove the website's home page. Promote another page as the home of your website, then remove this one
it: La pagina principale del sito non può essere rimossa. Per cancellare questa pagina promuovi un'altra pagina come homepage, poi procedi con la cancellazione

# exceptions-27
source: The page requires at least a template. Please provide the template name to add your page
it: Devi selezionare un template per la nuova pagina per poterla aggiungere

# exceptions-28
source: The web site already contains the page you are trying to add. Please use another name for that page
it: La pagina che stai tentando di aggiungere esiste già nel sito. Scegli un nome diverso per quella pagina

# exceptions-29
source: The web site has any language inserted. Please add a new language before adding a page
it: Il sito web non ha nessuna lingua inserita. Aggiungi una nuova lingua, poi procedi con l'aggiunta della nuova pagina

# exceptions-30
source: The page editing action has been aborted
it: La modifica della pagina è stata annullata

# exceptions-31
source: The page id argument must be a numeric value
it: L'identificativo della pagina deve essere un valore numerico

# exceptions-32
source: The language id argument must be a numeric value
it: L'identificativo della lingua deve essere un valore numerico

# exceptions-33
source: Blocks cannot be retrieved because the id language has not been set
it: I blocchi non possone essere recuperati perche' l'identificativo della lingua non è stato impostato

# exceptions-34
source: Blocks cannot be retrieved because the id page has not been set
it: I blocchi non possone essere recuperati perche' l'identificativo della pagina non è stato impostato

# exceptions-35
source: AlSeoManager is able to manage only AlSeo objects
it: AlSeoManager puo' gestire solamente oggetti del tipo AlSeo

# exceptions-36
source: The seo deleting action has been aborted
it: L'operazione di rimozione degli attributi dei motori di ricerca è stata annullata

# exceptions-37
source: The seo model object is null
it: L'oggetto seo è nullo

# exceptions-38
source: The seo adding action has been aborted
it: L'operazione di aggiunta di un nuovo attributo per i motori di ricerca è stata annullata

# exceptions-39
source: The LanguageId argument is mandatory to save a seo object
it: L'argomento LanguageId è richiesto per poter salvare un nuovo oggetto di tipo seo

# exceptions-40
source: The Permalink argument is mandatory to save a seo object
it: L'argomento Permalink è richiesto per poter salvare un nuovo oggetto di tipo seo

# exceptions-41
source: The seo editing action has been aborted
it: L'operazione di modifica degli attributi dei motori di ricerca è stata annullata

# exceptions-42
source: setForceSlotAttributes method accepts only boolean values
it: Il metodo setForceSlotAttributes accetta solamente valori booleani

# exceptions-43
source: setSkipSiteLevelBlocks method accepts only boolean values
it: Il metodo setSkipSiteLevelBlocks accetta solamente valori booleani

# exceptions-44
source: The %type% type does not exist
it: Il tipo %type% non esiste

# exceptions-45
source: The %className% adjustPosition protected method requires one of the following values: "%options%". Your input argument is: "%parameter%"
it: Il metodo protetto %className% adjustPosition richiede uno dei seguenti valori: "%options%". L'argomento fornito in ingresso è: "%parameter%"

# exceptions-46
source: The class %className% that shoud define a new Slot Converter does not exist
it: La classe %className% che dovrebbe definre un nuovo "Slot Converter" non esiste

# exceptions-47
source: slotToArray method accepts only strings
it: Il metodo slotToArray accetta solamente argomenti di tipo stringa

# exceptions-48
source: AlTemplateManager requires a template to set up the template slots: any given
it: Non è stato fornito alcun template all'oggetto AlTemplateManager per inizializzare gli slots

# exceptions-49
source: The template "%templateName%" has any slot attached. Please check your template's configuration
it: Il template "%templateName%" non ha definito nessuno slot. Verifica la configurazione del template stesso

# exceptions-50
source: AlValidator cannot check that at least once parameter exists because any "required parameters" has been given
it: AlValidator non puo' verificare l'esistenza di almeno uno dei parametri richiesti, in quanto non è stato fornito nemmeno un parametro di riscontro

# exceptions-51
source: AlValidator cannot check that at least once parameter exists because any "value" has been given
it: AlValidator non puo' verificare l'esistenza di almeno uno dei parametri richiesti, in quanto non è stato fornito alcun valore

# exceptions-52
source: At least one of those options are required: %required%. The options you gave are %values%
it: Almeno uno delle seguenti opzioni è richiesta: %required%. Le opzioni fornite sono: %values%

# exceptions-53
source: AlValidator cannot check that all the required parameters exist because any "required parameters" has been given
it: AlValidator non puo' verificare l'esistenza di tutti i parametri richiesti, in quanto non è stato fornito nemmeno un parametro di riscontro

# exceptions-54
source: AlValidator cannot check that all the required parameters exist because any "value" has been given
it: AlValidator non puo' verificare l'esistenza di tutti i parametri richiesti, in quanto non è stato fornito alcun valore

# exceptions-55
source: The following options are required: %required%. The options you gave are %values%
it: Le seguenti opzioni sono obbligatorie: %required%. Le opzioni fornite sono: %values%

# exceptions-56
source: "%className%" createEvent method requires the eventName argument to be a string
it: Il metodo createEvent della classe "%className%" richiede che l'argomento eventName sia una stringa

# exceptions-57
source: The class "%argumentClass%" passed as argument for the "%className%" createEvent method does not exist
it: La classe "%argumentClass%" passata come argomento per il metodo createEvent dell'oggetto "%className%" non esiste

# exceptions-58
source: The class "%argumentClass%" passed as argument for the "%className%" createEvent must be an instance of "Symfony\Component\EventDispatcher\Event"
it: La classe "%argumentClass%" passata come argomento per il metodo createEvent dell'oggetto "%className%" deve essere un'istanza della classe "Symfony\Component\EventDispatcher\Event"

# exceptions-59
source: Any event has been found to be dispatched
it: Non ci sono eventi da distribuire

# exceptions-60
source: The parameter "values" must be an array
it: Il parametro "values" deve essere un array

# exceptions-61
source: The repository for the "%blockType%" block type at the namespace "%namespace%" cannot be created
it: Il repository per il blocco di tipo "%blockType%" dischiarato nel namespace "%namespace%" non puo' essere creato

# exceptions-62
source: AlBlockRepositoryPropel accepts only AlBlock propel objects
it: AlBlockRepositoryPropel può accettare solamenti oggetti di tipo AlBlock

# exceptions-63
source: AlConfigurationRepositoryPropel accepts only AlConfiguration propel objects
it: AlConfigurationRepositoryPropel può accettare solamenti oggetti di tipo AlConfiguration

# exceptions-64
source: AlLanguageRepositoryPropel accepts only AlLanguage propel objects
it: AlLanguageRepositoryPropel può accettare solamenti oggetti di tipo AlLanguage

# exceptions-65
source: fromLanguageName method accepts only string values
it: Il metodo fromLanguageName accetta solamente argomenti stringa

# exceptions-66
source: AlLockedResourceRepositoryPropel accepts only AlLockedResource propel objects
it: AlLockedResourceRepositoryPropel può accettare solamenti oggetti di tipo AlLockedResource

# exceptions-67
source: AlPageRepositoryPropel accepts only AlPage propel objects
it: AlPageRepositoryPropelpuò accettare solamenti oggetti di tipo AlPage

# exceptions-68
source: fromPageName method accepts only string values
it: Il metodo fromPageName accetta solamente argomenti stringa

# exceptions-69
source: AlRoleRepositoryPropel accepts only AlRole propel objects
it: AlRoleRepositoryPropel può accettare solamenti oggetti di tipo AlRole

# exceptions-70
source: AlSeoRepositoryPropel accepts only AlSeo propel objects
it: AlSeoRepositoryPropel può accettare solamenti oggetti di tipo AlSeo

# exceptions-71
source: fromPermalink method accepts only string values
it: Il metodo fromPermalink accetta solamente argomenti stringa

# exceptions-72
source: AlUserRepositoryPropel accepts only AlUser propel objects
it: AlUserRepositoryPropel può accettare solamenti oggetti di tipo AlUser

# exceptions-73
source: The resource you requested is locked by another user. Please retry in a couple of minutes
it: La risorsa che hai richiesto è usata da un altro utente: riprova tra due minuti

# exceptions-74
source: The resource has not been locked due to an error occoured during the saving operation
it: La risorsa richiesta non può essere bloccata a causa di un errore durante il salvataggio

# exceptions-75
source: The template "%templateName%" does not seem to belong the "%themeName%" theme. Please check your template\'s configuration
it: Il template "%templateName%" non sembra appartenere al tema "%themeName%". Verifica la configurazione del template stesso

# exceptions-76
source: Template slots cannot be initialized
it: Gli slots del template non possono essere inizializzate

# exceptions-77
source: Cannnot fetch a valid language using the provided argument
it: Non posso recuperare una lingua utilizzando gli argomenti forniti

# exceptions-78
source: Cannnot fetch a valid page using the provided argument
it: Non posso recuperare una pagina utilizzando gli argomenti forniti

# exceptions-79
source: The requested language has not been found
it: La lingua richiesta non è stata trovata

# exceptions-80
source: The requested page has not been found
it: La pagina richiesta non è stata trovata

# exceptions-81
source: The PageId argument is mandatory to save a seo object
it: L'argomento PageId è richiesto per poter salvare un nuovo oggetto di tipo seo

# exceptions-82
source: The username already exists
it: L'utente esiste già

# exceptions-83
source: The role already exists
it: Il ruolo esiste già

# common-2
source: Undo
it: Annulla

# common-3
source: Save
it: Salva

# common-4
source: Close
it: Chiudi

# common-5
source: New
it: Nuovo

# common-6
source: Delete
it: Cancella

# common-7
source: Edit
it: Modifica

# common-8
source: Change
it: Cambia

# blocks-controller-1
source: The block has been successfully removed
it: Il blocco è stato correttamente eliminato

# blocks-controller-2
source: The block has not been removed
it: Il blocco non è stato eliminato

# blocks-controller-3
source: The key param is mandatory to open the right file manager
it: Il parametro key è richiesto per poter aprire il file manager desiderato

# blocks-controller-4
source: The block does not exist anymore or the slot has any block inside
it: Il blocco non esiste più oppure lo slot non contiene nessun blocco

# blocks-controller-5
source: The block has been successfully added
it: Il blocco è stato aggiunto correttamente

# blocks-controller-6
source: You can add just one block into an included block
it: Non puoi inserire più di un blocco all'interno di un blocco incluso

# blocks-controller-7
source: The block has not been added because an unespected error has occoured when saving
it: Il blocco non è stato aggiunto perchè si è verificato un errore inaspettato durante il salvataggio

# blocks-controller-8
source: You are trying to manage a block on a slot that does not exist on this page, or the slot name is empty
it: Stai tentando di gestire un blocco su uno slot che non esiste nella pagina, oppure il nome dello slot non è definito

# blocks-controller-9
source: The block has not been edited because an unespected error has occoured when saving
it: Il blocco non è stato modificato perchè si è verificato un errore inaspettato durante il salvataggio

# blocks-controller-10
source: It seems that anything has changed with the values you entered or the block you tried to edit does not exist anymore: nothing has been made
it: sembra che i valori forniti non abbiamo prodotto nessun risultato o che il blocco non esista più: nessuna operazione effettuata

# blocks-controller-11
source: The block you tried to remove does not exist anymore in the website
it: Il blocco che stai tentando di rimuovere non esiste più sul sito

# blocks-controller-12
source: The key param is mandatory to open the right file manager
it: Il parametro key è richiesto per operire il corretto gestore dei file

# blocks-controller-13
source: External file cannot be added because any file has been given
it: Il file esterno non può essere aggiunto perchè non è stato fornito nessun file

# blocks-controller-14
source: External file cannot be added because you have not provided any valid field name
it: Il file esterno non può essere aggiunto perchè non è stato fornito un nome del campo valido

# blocks-controller-15
source: You have already assigned this file to the block
it: Il file che stai tentando di aggiungere è stato già assegnato a questo blocco

# blocks-controller-16
source: The external file reference has not been added to this block because an unespected error has occoured when saving
it: Il riferimento al file esterno non è stato aggiunto al blocco in quanto si è verificato un errore imprevisto durante il salvataggio

# blocks-controller-17
source: You are trying to add an external file on a block that does not exist anymore
it: Stai tentando di aggiungere un file esterno ad un blocco che non esiste più

# blocks-controller-18
source: External file cannot be removed because any file has been given
it: Il file esterno non può essere rimosso in quanto non è stato fornito

# blocks-controller-19
source: External file cannot be removed because you have not provided any valid field name
it: Il file esterno non può essere aggiunto perchè non è stato fornito un nome del campo valido

# blocks-controller-20
source: The external file reference has not been removed from this block because an unespected error has occoured when saving
it: Il riferimento al file esterno non è stato rimosso al blocco in quanto si è verificato un errore imprevisto durante il salvataggio

# blocks-controller-21
source: You are trying to delete an external file from a block that does not exist anymore
it: Stai tentando di rimuovere un file esterno da un blocco che non esiste più

# blocks-controller-22
source: The page you are trying to edit does not exist
it: La pagina che stai tentando di modificare non esiste più

# blocks-controller-23
source: You are trying to manage a block on a slot that does not exist on this page, or the slot name is empty
it: Stai tentando di gestire un blocco su uno slot che non esiste più sulla pagina, oppure il nome dello slot è vuoto

# blocks-controller-24
source: The block has been successfully edited
it: Il blocco è stato modificato correttamente

# cms-controller-1
source: It seems that the "%page%" does not exist for the "%language%" language
it: Sembra che la pagina "%page%" non esista per il linguaggio "%language%"

# cms-controller-2
source: The template assigned to this page does not exist. This appens when you change a theme with a different number of templates from the active one. To fix this issue you shoud activate the previous theme again and change the template for the pages which cannot be rendered by this theme
it: Il template assegnato a questa pagina non esiste. Questo può succedere quando cambi tema con un numero diverso di template rispetto a quello in uso. Per corregere questo problema dovresti riattivare il tema precedente e cambiare il template delle pagine che non possono essere caricate usando questo tema.

# cms-controller-3
source: Pages
it: Pagine

# cms-controller-4
source: Languages
it: Lingue

# cms-controller-5
source: Themes
it: Temi

# cms-controller-7
source: Deploy Stage
it: Pubblica Stage

# cms-controller-8
source: Deploy Prod
it: Pubblica Prod

# cms-controller-9
source: Opens the panel to add, modify, delete pages from the website
it: Apre il pannello per aggiungere, modificare, eliminare le pagine dal sito

# cms-controller-10
source: Opens the panel to add, modify, delete languages from the website
it: Apre il pannello per aggiungere, modificare, eliminare le lingue dal sito

# cms-controller-11
source: Opens the panel to manage the website themes
it: Apre il pannello per gestire i temi del sito

# cms-controller-12
source: Opens the media library to upload, edit and remove external assets
it: Apre la media library per caricare, modificare e rimuorere file esterni

# cms-controller-13
source: Deploys the website for stage environment
it: Pubblica il sito per l'ambiente di stage

# cms-controller-14
source: Deploys the website for production
it: Pubblica il sito per l'ambiente di produzione

# cms-controller-15
source: Opens the panel to add, modify, delete users from the website
it: Apre il pannello per aggiungere, modificare, eliminare gli utenti dal sito

# cms-controller-16
source: Logs out from AlphaLemon CMS
it: Esce da AlphaLemon CMS

# cms-controller-17
source: Security
it: Sicurezza

# cms-controller-18
source: Logout
it: Esci

# cms-controller-19
source: Edits the current page
it: Modifica la pagina corrente

# cms-controller-20
source: Edit
it: Mod.

# cms-controller-21
source: Stops to edit the current page
it: Interrompe la modifica della pagina

# cms-controller-23
source: Opens the panel that contains the tools to navigate through the pages of your website
it: Apre il pannello che contiene gli strumenti per navigare tra le pagine del sito

# cms-controller-25
source: Starts to edit the template slots
it: Edita gli slots del template

# cms-controller-27
source: Stops to edit the template slots
it: Interrompe la modifica degli slots

# cms-controller-28
source: Finalizes the change of the website theme. This command should be used when all the templates slots have been mapped each other
it: Finalizza il cambiamento del tema del sito. Questo comando dovrebbe essere usato quando tutti gli slots dei template sono stati mappati

# cms-controller-29
source: Finalize
it: Finalizza

# configuration-controller-1
source: CMS language has been changed. Please wait while your site is reloading
it: La lingua del CMS e' stata cambiata. Attendi mentre la pagina viene ricaricata

# configuration-controller-2
source: An error occoured when changing CMS language
it: Si e' verificato un errore mentre veniva cambiata la lingua del CMS

# configuration-controller-3
source: The language "%language%" is the one already in use
it: La lingua "%language%" e' attualmente in uso

# languages-controller-1
source: Language attributes
it: Attributi della lingua

# languages-controller-2
source: Language
it: Lingua

# languages-controller-3
source: Choose the language
it: Scegli la lingua

# languages-controller-4
source: When checked, promotes the language as the website's main language, which is the one displayed when any language has been given
it: Seleziona questa opzione per promuovere la lingua selezionata a lingua principale del sito. Il linguaggio principale e' quello mostrato di default quando non e' stata richiesta una lingua in particolare
